## User story
>**Как держатель акций и/или криптовалют, я хочу видеть на одной странице одновременно и акции, и криптовалюты, и изменение их стоимости, что очень сильно упрощает процесс отслеживания своего портфеля.**
>
>Критерии:
+ отображение графика изменения стоимости портфеля
+ вывод перечня акций и их стоимости
+ красивый и удобный интерфейс полностью на русском языке


## User story
>**Как держатель акций и/или криптовалют при добавлении активов, я хочу, чтобы у сайта был удобный функционал.**
>
>Критерии:
+ список активов(акций\криптовалюты) для добавления с их названиями
+ окно для добавления актива с вводом стоимости, дня покупки и остального
+ отображение добавленного актива в портфеле

## Use case
>Название: **Добавление акционного портфеля**
>
>Акторы: Пользователь, Система, сайт
>
>Предусловия:
+ пользователь авторизован;
+ пользователь выбрал актив/активы для отслеживания
  
>Основной поток:
1. Пользователь нажимает на кнопку “добавить актив”
2. Система отображает окно выбора активов
3. Пользователь ищет в окне нужный актив
4. Найдя нужный актив, он на него нажимает
5. Система отображает новое окно добавления активов
6. В этом окне пользователь вводит количество актива и его стоимость на момент покупки
7. Пользователь нажимает кнопку “добавить актив”
8. Система переносит пользователя на страницу его портфеля и отображает изменения
   
>Альтернативные потоки:
>>А1: Пользователь не находит нужный актив в списке → звонит на телефон горячей линии и просит добавить его актив
>>
>>А2: Пользователь не корректно вводит данные (отрицательная стоимость актива, вводит не численные значения и др.) → кнопка “добавить актив” не работает

>Постусловия:
+ задача решена или пользователь звонит на горячую линию
+ прогресс пользователя обновлён в системе


## Use case
>Название: **Отображение информации в профиле пользователя**
>
>Акторы: Пользователь, Система, сайт
>
>Предусловия:
+ пользователь авторизован;
  
>Основной поток:
1. Пользователь нажимает кнопку профиля пользователя
2. Система отображает окно профиля
3. Сайт отображает виджет "Текущий баланс"
4. Текущий баланс отображает  баланс пользователя, прибыль инвестиции, измененние стоимости основного актива, кнопка отчетного периода профиля
5. Пользователь выбирает период отчета по нажатию кнопки
6. На сайте пользователь видет график стоимости своих активов за все время
7. Сайт отображает информацию об активах пользователя
8. В поле "Ваши активы" отображаются поля: "Актив", "Цена/7д %", "7д Прибыль", "Инвестиции", "Средняя цена", "Текущая прибыль",
9. У пользователя есть возможность с профиля перейти в окно "Добавить актив"
   
---
## Use case
>Название: **Расчет торгового баланса, инвестиций и прибыли**
>
>Акторы: Пользователь, Система, сайт
>
>Предусловия:
+ пользователь авторизован;
+ пользователь добавил в портфель активы
  
>Основной поток для торгового баланса:
1. Система рассчитывает баланс по формуле: **Нынешняя стоимость активов с учетом курса * количество активов**
2. Система отображает добавленные активы на общем графике и также в специальном окне
>
>Основной поток для инвестиций:
1. Система рассчитывает инвестиции по формуле: **Стоимость покупки активов с учетом курса на определенный момент времени * количество активов**
2. Система отображает добавленные активы на общем графике и также показывает сумму инвестиций в специальном окне
>
>Основной поток для прибыли:
1. Система рассчитывает прибыль по формуле: **(Стоимость покупки - Нынешняя стоимость) * количество активов**
2. Система отображает добавленные активы на общем графике и также в специальном окне и обновляет сайт, изменяя график
>
>Альтернативные потоки:
>>А1: пользователь ввел некорректные данные, из-за чего система не приступила к вычислениям

---

## Use case
>Название: **Совмещение валют**
>
>Акторы: Пользователь, Система, сайт
>
>Предусловия:
+ пользователь авторизован;
+ пользователь выбрал активы для отслеживания
  
>Основной поток:
1. Пользователь в настройках выбирает необходимую валюту(доллар, рубль, юань)
2. Система обращается к базе данных за курсом валюты на текущий момент времени
3. Система получает данные и переводит все числа на сайте в запрашиваемую валюту
   
>Альтернативные потоки:
>>А1: пользователь не нашел желаемую валюту -> звонит в службу поддержки и плачет





